//======================================================================================================
/******************************************************************************************************
 *                                                                                                     
 *            文件名称:              
 *
 *                摘要: 
 *
 *            创建时间: 2012-05-xx  
 *
 *            修改时间: 2012-05-xx
 *
 *******************************************************************************************************/
//======================================================================================================
#include "mystd.h"
#include "WM.h"
#include "msg.h"


extern AFX_MSGMAP_ENTRY* GetMessageMap(void);
extern WM_HWIN  GetHWnd(void);

//======================================================================================================
/*******************************************************************************************************
 *
 *         函数名称: 
 *
 *         函数功能: 
 *
 *         入口参数: 
 *
 *         出口参数: 无
 *
 *             说明:
 *
 *******************************************************************************************************/
static BOOL OnCommand(WM_MESSAGE * pMsg)
{
    int id;
    
    AFX_MSGMAP_ENTRY* lpEntry;
    lpEntry = GetMessageMap();   
     
    id = WM_GetId(pMsg->hWinSrc);
    for (; lpEntry->nSig != AfxSig_end; lpEntry++)
    {
         if (lpEntry->nID == id)
         {
             (*lpEntry->pfn)(pMsg); 
             return 1;
              
         }        
    }
     
    return 0;
       
    
}

//======================================================================================================
/*******************************************************************************************************
 *
 *         函数名称: 
 *
 *         函数功能: 
 *
 *         入口参数: 
 *
 *         出口参数: 无
 *
 *             说明:
 *
 *******************************************************************************************************/
BOOL WinMsgProc(WM_MESSAGE * pMsg, AFX_MSGMAP_ENTRY*lpEntry) 
{
    //* lpEntry;
    
    if (pMsg->MsgId == WM_PAINT) //加快Piant 消息的处理
    {
         (*lpEntry->pfn)(pMsg); 
          return 1;         
    }
    
    if ((pMsg->MsgId == WM_NOTIFY_PARENT) && (pMsg->Data.v == WM_NOTIFICATION_CLICKED)) //处理单击命令
    {
         if (OnCommand(pMsg))
         {
             return 1;   //消息已处理
         }
        
    }
    
    if (pMsg->MsgId == WM_NOTIFY_PARENT)
    {
        return 0;   
    }
    
    lpEntry = GetMessageMap();

    for (; lpEntry->nSig != AfxSig_end; lpEntry++)
    {
         if (lpEntry->nMessage == pMsg->MsgId)
         {
             (*lpEntry->pfn)(pMsg); 
             return 1;
         }
        
    }
    
    return 0;
    
}
