//======================================================================================================
/******************************************************************************************************
 *                                                                                                     
 *            文件名称:              
 *
 *                摘要: 
 *
 *            创建时间: 2012-05-xx  
 *
 *            修改时间: 2012-05-xx
 *            修改原因:
 *
 *            
 *
 *                作者: 杨卫华
 *
 *******************************************************************************************************/
//======================================================================================================
#include "stm32f4xx.h"
#include "ucos_ii.h"
#include "mystd.h"  
#include "m_config.h"
#include "SysAppConfig.h"
#include "UserLib.h"
#include "FramePack.h"
#include "CommHandle.h"
#include "main.h"
#include "tasks.h"
#include "INOut.h"



//================================================================================================
OS_EVENT    *INOUT_MBOX;


//======================================================================================================
/*******************************************************************************************************
 *
 *         函数名称: 
 *
 *         函数功能:  打包发送开入状态
 *
 *         入口参数: 
 *
 *         出口参数: 无
 *
 *             说明:
 *
 *******************************************************************************************************/
void  INOutTask(void *p_arg)
{
    void      *rt;
    INT8U     err;
    uint32_t  q_state;
    //uint16_t  state;

	//static   uint8_t   buff[2];
    uint8_t   buff[2];
    
    
    //state = 0; 
    while(TRUE_P)
    {
        //由下面的程序发送信号量来同步
        rt = OSMboxPend(INOUT_MBOX, 0, &err);  //开入中断里发送消息 OSMboxPost(INOUT_MBOX, (void *)in_state);
        if (err == OS_ERR_NONE)
        {
            //buff[0] = (uint32_t)rt; 
            //TRACE("valid value is %d\r\n", buff[0]);
            q_state = (uint32_t)rt;
            buff[0] = q_state & 0xFF;
            buff[1] = (q_state & 0xFF00) >> 8;
            //state &= ~(0x01 << q_state);//q_state的高16位是该状态位的bits number
            //state |= (uint16_t)q_state;

            SendFrame(STATE_W_CW, (uint8_t *)buff, 2);   //2即2个字节,16bit

        
        }

    }

}


