#ifndef  __CAPHER_H
#define  __CAPHER_H


//=================================================================================================
//*************************************************************************************************
//宏定义
#define DES_KEY_INDEX   256
#define APP_KEY_INDEX   512

//=================================================================================================
//*************************************************************************************************
//数据类型定义



//=================================================================================================
//*************************************************************************************************
//外部函数声明

extern int16_t  StartDesProc(COMM_FRAME *pcf);
extern int16_t  DesKeyProc(COMM_FRAME *pcf);
extern void StoreKey(uint8_t *random_buff, uint8_t *key_out_buff, uint16_t store_index, uint8_t store_len);
extern void TakeOutKey(uint8_t *key_out_buff, uint16_t take_out_index, uint8_t take_out_len);





#endif   //__CAPHER_H


