
//===============================================================================================
/************************************************************************************************
*                                                                                                     
*            文件名称:              
*
*                摘要: 
*
*            创建时间: 2012-05-20  
*
*            修改时间: 2012-05-20 
*            修改原因:
*
*            
*
*                作者: 杨卫华
*
*************************************************************************************************/
//===============================================================================================

#ifndef __COMM_TASK_PROC_H
#define __COMM_TASK_PROC_H

//=================================================================================================
//*************************************************************************************************
//宏定义

#define  GET_CMD_HWORD(pcf)        MAKE_HWORD((pcf)->param[2], (pcf)->param[1])
#define  GET_DATA0_HWORD(pcf)      MAKE_HWORD((pcf)->param[4], (pcf)->param[3])
#define  GET_DATA1_HWORD(pcf)      MAKE_HWORD((pcf)->param[6], (pcf)->param[5])
#define  GET_DATA2_HWORD(pcf)      MAKE_HWORD((pcf)->param[8], (pcf)->param[7])


#define  APP_PROC_ADDR             FLASH_Sector_3
#define  APP_ADDR                  FLASH_Sector_4
//=================================================================================================
//*************************************************************************************************
//数据类型定义



//=================================================================================================
//*************************************************************************************************
//变量定义

//========================================================================================
//


//=================================================================================================
//*************************************************************************************************
//外部函数声明
void jump(void);

extern  int16_t  RevCtrlProc(COMM_FRAME *pcf);
extern  int16_t  OilCntCtrlProc(COMM_FRAME *pcf);
extern  int16_t  TmptrCtrlProc(COMM_FRAME *pcf);
extern  int16_t  FuelInjeCommRailCtrlProc(COMM_FRAME *pcf);
extern  int16_t  InProcCheckProc(COMM_FRAME *pcf);
extern  int16_t  InProcCheckProc(COMM_FRAME *pcf);
extern  int16_t  MeaCylNetWeightProc(COMM_FRAME *pcf);
extern  int16_t  ChkWeightProc(COMM_FRAME *pcf);
extern  int16_t  DLDebugProc(COMM_FRAME *pcf);
extern  int16_t  AngleCtrlProc(COMM_FRAME *pcf);




#endif    //__COMM_TASK_PROC_H



