//===============================================================================================
/************************************************************************************************
*                                                                                                     
*            文件名称:              
*
*                摘要: 
*
*            创建时间: 2012-05-20  
*
*            修改时间: 2012-05-20 
*            修改原因:
*
*            
*
*                作者: 杨卫华
*
*************************************************************************************************/
//===============================================================================================

#ifndef __SIMU_I2C_H
#define __SIMU_I2C_H

//=================================================================================================
//*************************************************************************************************
//宏定义

///#define I2C_Speed              100000
#define I2C1_SLAVE_ADDRESS7    0xA0
#define I2C_PageSize           16

#define I2C_READ              0x01
#define I2C_WRITE             0x00

#define SCL_H         GPIO_SetBits(GPIOB, GPIO_Pin_8)
#define SCL_L         GPIO_ResetBits(GPIOB, GPIO_Pin_8)
   
#define SDA_H         GPIO_SetBits(GPIOB, GPIO_Pin_9)
#define SDA_L         GPIO_ResetBits(GPIOB, GPIO_Pin_9)

#define SCL_read      (GPIOB->IDR  & GPIO_Pin_8)
#define SDA_read      (GPIOB->IDR  & GPIO_Pin_9)





//=================================================================================================
//*************************************************************************************************
//数据类型定义



//=================================================================================================
//*************************************************************************************************
//变量定义

//========================================================================================
//


//=================================================================================================
//*************************************************************************************************
//外部函数声明

extern void  InitSimuI2C(void);
extern BOOL I2C_Simu_BuffWrite(u8* pBuffer, u16 WriteAddr, u16 NumByteToWrite);
extern BOOL I2C_Simu_BuffRead(u8* pBuffer, u16 ReadAddr, u16 NumByteToRead);
extern BOOL I2C_Simu_ReadByte(u8 *byte_data, u16 addr);
extern BOOL I2C_Simu_WriteByte(u8 byte_data, u16 addr);
extern void  I2CWriteTest(void);
extern BOOL I2C_Simu_ReadMulBytes(u8* pBuffer, u16 ReadAddr, u16 NumByteToRead);
extern BOOL I2C_Simu_WriteMulBytes(u8* pBuffer, u16 WriteAddr, u16 NumByteToWrite);

#endif    //__SIMU_I2C_H
