//===============================================================================================
/************************************************************************************************
 *                                                                                                     
 *            文件名称: NVT.C              
 *
 *                摘要: 英威腾变频器通讯协议(CHE系列矢量变频器)
 *
 *            创建时间: 2008-03-03  
 *
 *            修改时间: 2008-03-03
 *            修改原因:
 *
 *            
 *
 *                作者: 杨卫华
 *
 *************************************************************************************************/
//===============================================================================================
#include "stm32f4xx.h" 
#include "stm32f4_std_libs.h"
#include "MyLib.h"
#include "UART.h"
#include "transducer.h"



extern UINT16 CRC(UINT8 *puchMsg , UINT32 usDataLen);




//================================================================================================
/*************************************************************************************************
 *
 *         函数名称: 
 *
 *         函数功能: 
 *
 *         入口参数: 
 *
 *         出口参数: 无
 *
 *             说明:
 *
 *************************************************************************************************/
void EDSRun(UINT16 rev_fwd, UINT16 rev_num)
{

    UINT8   i;
    UINT8   buff[20];
    UINT16  tmp_crc;
  
    Wait(60000); 
    Wait(60000);
	Wait(60000);
	Wait(60000);  
	Wait(60000);    
	
	//////OSTimeDly(100);
		
    buff[0] = 0x01;
    buff[1] = 0x06;  //写入单笔数据
    
    buff[2] = 0x02;  //地址0x279 633
    buff[3] = 0x79; 
    
    //buff[2] = 0x20;  //地址
    //buff[3] = 0x00;  
    
    buff[4] = 0;
       
    if (rev_fwd == FWD_RUN)
    {   
        buff[5] = 7;
    }
    else if (rev_fwd == REV_RUN)
    {
        buff[5] = 8;
    
    }
    
    tmp_crc = CRC(buff, 6);
    
    buff[7] = tmp_crc & 0xFF;   //低位在先
    buff[6] = tmp_crc >> 8;
    
    for (i = 0; i < 8; i++)
    {
        UARTSendByte(TRANSD_CHNNL, buff[i]);
        Wait(10);
    
    }   
	     
	
    Wait(60000); 
    Wait(60000);
	Wait(60000);
	Wait(60000);   
	Wait(60000); 
	Wait(60000); 
    Wait(60000); 
  	  
      
    
    
    Wait(60000); 
    Wait(60000);
	Wait(60000);
	Wait(60000);  
	Wait(60000); 
	//Wait(60000); 
    //Wait(60000); 
    
    //写入频率
	buff[0] = 0x01;
	buff[1] = 0x06;  //写入单笔数据 
	
	buff[2] = 0x5;  //地址0x506 1282
	buff[3] = 0x2;
	
	//buff[2] = 0x09;  //地址
	//buff[3] = 0x07;
	    
	rev_num *= 10;
	rev_num /= 3;
	        
	buff[4] = rev_num >> 8;
	buff[5] = rev_num & 0xFF;
	    
	tmp_crc = CRC(buff, 6);
	    
	buff[7] = tmp_crc & 0xFF;   //低位在先
	buff[6] = tmp_crc >> 8;
	       
	for (i = 0; i < 8; i++)
	{
	    UARTSendByte(TRANSD_CHNNL, buff[i]);
	    Wait(10);
	    
	}   
   
    
          
}





//================================================================================================
/*************************************************************************************************
 *
 *         函数名称: 
 *
 *         函数功能: 
 *
 *         入口参数: 
 *
 *         出口参数: 无
 *
 *             说明:
 *
 *************************************************************************************************/
void EDSStop(UINT16 rev_fwd)
{
    UINT8   i;
    UINT8   buff[20];
    UINT16  tmp_crc;
    
    buff[0] = 0x01;
    buff[1] = 0x06;  //写入单笔数据
    buff[2] = 0x02;  //地址0x279 633
    buff[3] = 0x79;
    
    buff[4] = 0x00;
    
    buff[5] = 6;
    
    //if (rev_fwd == FWD_STOP)
    //{   
    //    buff[5] = 0x0;
    //}
    //else if (rev_fwd == REV_STOP)
    //{
    //    buff[5] = 0x02;
    
    //}
    
    tmp_crc = CRC(buff, 6);
    
    buff[7] = tmp_crc & 0xFF;   //低位在先
    buff[6] = tmp_crc >> 8;
    
    
    for (i = 0; i < 8; i++)
    {
        UARTSendByte(TRANSD_CHNNL, buff[i]);
        Wait(10);
    
    }    
   
  
} 


