//===============================================================================================
/************************************************************************************************
 *                                                                                                     
 *            文件名称:              
 *
 *                摘要: 
 *
 *            创建时间: 2006-09-20  
 *
 *            修改时间: 2006-09-20
 *            修改原因:
 *
 *            
 *                说明:变频器应进行如下设定:
 *                     02-00: 04     主频由RS485提供
 *                     02-01: 03/04  运转指令由RS485提供，按键STOP 有效/无效
 *                     09-00: 01     从机地址
 *                     09-01: 00     波特率4800 
 *                     09-04: 02     8-bit for RTU
 *                     09-05: 05     Odd Parity + 1 stop bit //
 *
 *                作者: 杨卫华
 *
 *************************************************************************************************/
 //===============================================================================================
#include "44B0X.h"
#include "MyLib.h"
#include "UART.h"
#include "transducer.h"
#include "Utils.h"  



//================================================================================================
/*************************************************************************************************
 *
 *         函数名称: 
 *
 *         函数功能: 
 *
 *         入口参数: 
 *
 *         出口参数: 无
 *
 *             说明:
 *
 *************************************************************************************************/
void VFDRunB(UINT16 rev_fwd, UINT16 rev_num)
{
    UINT8    i;
    UINT8   buff[20];
    UINT16  tmp_crc;
    
    
    //DelayS(2);
    ///Wait(500000);
    Wait(500000);  
    //ENA_RS485_OUT();  
    //写入频率
	buff[0] = 0x01;
	buff[1] = 0x06;  //写入单笔数据
	
	
	buff[2] = 0x20;  //地址
	buff[3] = 1;
	    
	rev_num *= 10;
	rev_num /= 3;
	        
	buff[4] = rev_num >> 8;
	buff[5] = rev_num & 0xFF;
	    
	tmp_crc = CRCCheck(buff, 6);
	    
	buff[6] = tmp_crc & 0xFF;   //低位在先
	buff[7] = tmp_crc >> 8;
	
	//ENA_RS485_OUT();        
	for (i = 0; i < 8; i++)
	{
  	    UARTSendByte(TRANSD_CHNNL, buff[i]);
	    Wait(30);
	    
	} 
	  
	//Wait(600);    
	//DIS_RS485_OUT(); 
    Wait(500000); //2008-08-24 
    //Wait(600000);  
    
    
  	//ENA_RS485_OUT();  
    buff[0] = 0x01;
    buff[1] = 0x06;  //写入单笔数据
    buff[2] = 0x20;  //地址
    buff[3] = 0x00;  
    
    buff[4] = 0;
       
    if (rev_fwd == FWD_RUN)
    {   
        buff[5] = 0x12;
    }
    else if (rev_fwd == REV_RUN)
    {
        buff[5] = 0x22;
    
    }
    
    tmp_crc = CRCCheck(buff, 6);
    
    buff[6] = tmp_crc & 0xFF;   //低位在先
    buff[7] = tmp_crc >> 8;
    
    
    for (i = 0; i < 8; i++)
    {
        UARTSendByte(TRANSD_CHNNL, buff[i]);
        Wait(30);
    
    }   
    
    //Wait(300000); 
    //Wait(600000); 
    //DIS_RS485_OUT(); 
          
}


//================================================================================================
/*************************************************************************************************
 *
 *         函数名称: 
 *
 *         函数功能: 
 *
 *         入口参数: 
 *
 *         出口参数: 无
 *
 *             说明:
 *
 *************************************************************************************************/
void VFDRun(UINT16 rev_fwd, UINT16 rev_num)
{
    UINT8    i;
    UINT8   buff[20];
    UINT16  tmp_crc;
    
    
    //DelayS(2);
    ///Wait(500000);
    Wait(500000);  //2008-08-24 
    //ENA_RS485_OUT();  
    //写入频率
	buff[0] = 0x01;
	buff[1] = 0x06;  //写入单笔数据
	buff[2] = 0x09;  //地址
	buff[3] = 0x07;
	    
	rev_num *= 10;
	rev_num /= 3;
	        
	buff[4] = rev_num >> 8;
	buff[5] = rev_num & 0xFF;
	    
	tmp_crc = CRCCheck(buff, 6);
	    
	buff[6] = tmp_crc & 0xFF;   //低位在先
	buff[7] = tmp_crc >> 8;
	
	//ENA_RS485_OUT();        
	for (i = 0; i < 8; i++)
	{
  	    UARTSendByte(TRANSD_CHNNL, buff[i]);
	    Wait(30);
	    
	} 
	  
	//Wait(600);    
	//DIS_RS485_OUT(); 
    Wait(500000);//2008-08-24 
    //Wait(600000);  
    
    
  	//ENA_RS485_OUT();  
    buff[0] = 0x01;
    buff[1] = 0x06;  //写入单笔数据
    buff[2] = 0x20;  //地址
    buff[3] = 0x00;  
    
    buff[4] = 0;
       
    if (rev_fwd == FWD_RUN)
    {   
        buff[5] = 0x12;
    }
    else if (rev_fwd == REV_RUN)
    {
        buff[5] = 0x22;
    
    }
    
    tmp_crc = CRCCheck(buff, 6);
    
    buff[6] = tmp_crc & 0xFF;   //低位在先
    buff[7] = tmp_crc >> 8;
    
    
    for (i = 0; i < 8; i++)
    {
        UARTSendByte(TRANSD_CHNNL, buff[i]);
        Wait(30);
    
    }   
    
    //Wait(300000); 
    //Wait(600000); 
    //DIS_RS485_OUT(); 
          
}

//================================================================================================
/*************************************************************************************************
 *
 *         函数名称: 
 *
 *         函数功能: 
 *
 *         入口参数: 
 *
 *         出口参数: 无
 *
 *             说明:
 *
 *************************************************************************************************/
void VFDStop(UINT16 rev_fwd)
{
    UINT8   i;
    UINT8   buff[20];
    UINT16  tmp_crc;
    
    Wait(400000);  //2008-08-24 
    
    buff[0] = 0x01;
    buff[1] = 0x06;  //写入单笔数据
    buff[2] = 0x20;  //地址
    buff[3] = 0x00;
    
    buff[4] = 0x00;
    if (rev_fwd == FWD_STOP)
    {   
        buff[5] = 0x11;
    }
    else if (rev_fwd == REV_STOP)
    {
        buff[5] = 0x21;
    
    }
    
    tmp_crc = CRCCheck(buff, 6);
    
    buff[6] = tmp_crc & 0xFF;   //低位在先
    buff[7] = tmp_crc >> 8;
    
    //ENA_RS485_OUT();  
    for (i = 0; i < 8; i++)
    {
        UARTSendByte(TRANSD_CHNNL, buff[i]);
        Wait(30);
    
    }  
    //Wait(600000); 
    //DIS_RS485_OUT();  
   
  
} 







