//===============================================================================================
/************************************************************************************************
*                                                                                                     
*            文件名称:AD.c              
*
*                摘要: 
*                   引脚名称	对应IO管脚	  开入/开出
*                   SPI1_NSS	    PA4	        开出
*                   SPI1_SCK	    PA5	        开出
*                   SPI1_MISO	    PA6	        开入
*                   SPI1_MOSI	    PA7 	    开出
*
*            创建时间: 2009-07-03 
*
*            修改时间: 
*            修改原因:
*
*            
*
*                作者: yijie
*
*************************************************************************************************/
//===============================================================================================
#include "stm32f4xx.h"
#include "stm32f4_std_libs.h"
#include "mystd.h"
#include "m_config.h"
#include "InitHW.h"
#include "UART.h"
#include "UserLib.h"
#include "AD.h"
#include "ADS784X.h"


/*************************************************************************************************
*         
*         函数名称: InitAD
*
*         函数功能: 初始化AD相关
*
*         入口参数: 
*
*         出口参数: 无
*
*             说明:
*
*************************************************************************************************/
void InitAD(void)
{
    InitADS784xPin();
    
}





/*************************************************************************************************
*
*         函数名称: ADSampl
*
*         函数功能:  采样数据
*
*         入口参数: 通道0-3
*
*         出口参数: 无
*
*             说明:
*
*************************************************************************************************/
u16  ADSampl(u8 chnnl)
{      
    u8 ad_ctrl_word = 0;
    
    switch(chnnl)
    {
    case 0:
        {
            ad_ctrl_word = 0x01 << 4;
            break;
        }
        
    case 1:
        {
            ad_ctrl_word = 0x05 << 4;
            break;
        }
    case 2:
        {
            ad_ctrl_word = 0x02 << 4;
            break;
        }
    case 3:
        {
            ad_ctrl_word = 0x06 << 4;
            break;
            
        }
    default:
        {
            
            
        }
        
    }
    
    
    ad_ctrl_word |= ((1 << 7) | (1 << 2) | (0x00));  //启动标志
    
    return(ADS784xAD(ad_ctrl_word));
    
}
