//======================================================================================================
/******************************************************************************************************
 *                                                                                                     
 *            文件名称:              
 *
 *                摘要: 
 *
 *            创建时间: 2012-05-xx  
 *
 *            修改时间: 2012-05-xx
 *            修改原因:
 *
 *            
 *
 *                作者: 
 *
 *******************************************************************************************************/
//======================================================================================================
#include <stdio.h>
#include <stdarg.h>
#include "stm32f4xx.h"
#include "stm32f4xx_fsmc.h"
#include "mystd.h"
#include "m_config.h"
#include "CPUID.h"

#define  CPU_ID_BASE_ADDR   0x1FFF7A10
#define  CPU_FLASH_SIZE_INFO_ADDR_BASE 0x1FFF7A22

/*************************************************************************************************
*         
*         函数名称: ReadID
*
*         函数功能:读取96位ID值
*
*         入口参数: 
*
*         出口参数: 无
*
*             说明:
*
*************************************************************************************************/
void ReadCPUID(CPU_INFO *pinfo)
{
    
    pinfo->id[0] = *(volatile uint32_t *)(CPU_ID_BASE_ADDR);
    pinfo->id[1] = *(volatile uint32_t *)(CPU_ID_BASE_ADDR + 4);
    pinfo->id[2] = *(volatile uint32_t *)(CPU_ID_BASE_ADDR + 8);
    
    pinfo->flash_info = *(volatile uint32_t *)(CPU_FLASH_SIZE_INFO_ADDR_BASE);
    
    
}


