#include "stm32f4xx.h"
#include "Filter.h"

//============================================================================
FILTER F1;
FILTER *pF1;
FILTER F2;
FILTER *pF2;
FILTER F3;
FILTER *pF3;
FILTER F4;
FILTER *pF4;

/*************************************************************************************************
*
*         函数名称: InitFILTER
*
*         函数功能: 滤波
*
*         入口参数: 通道
*
*         出口参数: 无
*
*             说明:
*
*************************************************************************************************/
void InitFILTER(void)
{
	pF1 = &F1;
	InitF(pF1);
	pF2 = &F2;
	InitF(pF2);
	pF3 = &F3;
	InitF(pF3);
	pF4 = &F4;
	InitF(pF4);
}

/*************************************************************************************************
*
*         函数名称: InitF
*
*         函数功能: 采样数据
*
*         入口参数: 通道
*
*         出口参数: 无
*
*             说明:
*
*************************************************************************************************/
void InitF(FILTER *pF)
{
   pF->total    = 0;
   pF->n        = 0;

}
/*************************************************************************************************
*
*         函数名称: filter(u32 cmd)
*
*         函数功能: 数字滤波器（Digital Filter）是由数字乘法器、加法器和延时单元组成的一种装置，
*                   其功能是对输入离散信号的数字代码进行运算处理，以达到改变信号频谱的目的。
*                   取N个采样值求平均，RAM中要开辟N个数据的暂存区。每采集一个数据都要存入暂存区，
*                   同时去掉一个最早的数据，保持这N个数据始终是最近的数据[5-6].
*
*         入口参数: 
*
*         出口参数: 无
*
*             说明:
*
*************************************************************************************************/
s32 Filter(u8 num,s32 data)
{
	s32 tmp_filter;

	switch(num)
	{
		case 0:
			 tmp_filter = Filter_num(pF1,data);
			 break;
		case 1:
			 tmp_filter = Filter_num(pF2,data);
			 break;
		case 2:
			 tmp_filter = Filter_num(pF3,data);
			 break;
		case 3:
			 tmp_filter = Filter_num(pF4,data);
			 break;
	}

	return tmp_filter;
	 	   
}
/*************************************************************************************************
*
*         函数名称: filter_num
*
*         函数功能: 采样数据
*
*         入口参数: 通道
*
*         出口参数: 无
*
*             说明:
*
*************************************************************************************************/
s32 Filter_num(FILTER *pF,s32 data)
{
	s32 tmp_fil;
	pF->total -= pF->buff[pF->n];		 //滤波缓冲区的大小
	pF->buff[pF->n] = data;
	pF->n++;
	if( pF->n == FIL_LEN)
	{
	   pF->n = 0;
	}
	pF->total += data;
	
	tmp_fil = pF->total/FIL_LEN;

	return tmp_fil;
	 	   
}


