//======================================================================================================
/******************************************************************************************************
 *                                                                                                     
 *            文件名称:              
 *
 *                摘要: 
 *
 *            创建时间: 2012-05-xx  
 *
 *            修改时间: 2012-05-xx
 *            修改原因:
 *
 *            
 *
 *                作者: 
 *
 *******************************************************************************************************/
//======================================================================================================
#include <stdio.h>
#include <stdarg.h>
//#include <absacc.h>
#include "stm32f4xx.h"
#include "stm32f4_std_libs.h"
#include "mystd.h"
#include "SimuI2C.h"
#include "UserLib.h"


//============================================================================================
vu8 FRAM_ADDRESS;
#define  _24WC08

uint8_t Key3[4]={0xAC,0x8D,0xE7,0x38};

//======================================================================================================
/*******************************************************************************************************
 *
 *         函数名称: 
 *
 *         函数功能: 
 *
 *         入口参数: 
 *
 *         出口参数: 无
 *
 *             说明:
 *
 *******************************************************************************************************/
void  I2CWriteTest(void)
{
    u8  buff[512];
    u8 *p;
    int i;
    
    for (i = 0; i < 512; i++)
    {
        buff[i] = i;
    }
    

    p = buff;
    for (i = 0; i < 512; i++)
    {
        I2C_Simu_WriteByte(*p, i);
        p++;
        
    }
    
    for (i = 0; i < 512; i++)
    {
        buff[i] = 0;
    }
    
    p = buff;
    for (i = 0; i < 512; i++)
    {
        I2C_Simu_ReadByte(p, i);
        p++;
    }
    
}


//======================================================================================================
/*******************************************************************************************************
 *
 *         函数名称: 
 *
 *         函数功能: 
 *
 *         入口参数: 
 *
 *         出口参数: 无
 *
 *             说明:
 *
 *******************************************************************************************************/
void I2C_delay(void)
{        
    u16 i = 1500; //这里可以优化速度        ，经测试最低到5还能写入
    
    while(i--) 
    { 
        ; 
    } 
    
}

//======================================================================================================
/*******************************************************************************************************
 *
 *         函数名称: 
 *
 *         函数功能: 
 *
 *         入口参数: 
 *
 *         出口参数: 无
 *
 *             说明:
 *
 *******************************************************************************************************/
void  InitSimuI2C(void)
{
    GPIO_InitTypeDef  GPIO_InitStructure;    
    GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_OUT;
    GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;
    GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_UP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;

    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8;
    GPIO_SetBits(GPIOB, GPIO_Pin_8);
    GPIO_Init(GPIOB, &GPIO_InitStructure);

    /* config SDA PIN */
    GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_OUT;
    GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;
    GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_UP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;

    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
    GPIO_SetBits(GPIOB, GPIO_Pin_9);
    GPIO_Init(GPIOB, &GPIO_InitStructure);
    
    
}


//======================================================================================================
/*******************************************************************************************************
 *
 *         函数名称: 
 *
 *         函数功能: 
 *
 *         入口参数: 
 *
 *         出口参数: 无
 *
 *             说明:
 *
 *******************************************************************************************************/
BOOL I2C_Start(void)
{
    SDA_H;
    SCL_H;
    I2C_delay();
    if(!SDA_read)
    {
        return FALSE;        //SDA线为低电平则总线忙,退出
    }
    
    SDA_L;
    I2C_delay();
    
    if(SDA_read) 
    {
        return FALSE;        //SDA线为高电平则总线出错,退出
    }
    
    SDA_L;
    I2C_delay();
    
    return TRUE;
    
}

//======================================================================================================
/*******************************************************************************************************
 *
 *         函数名称: 
 *
 *         函数功能: 
 *
 *         入口参数: 
 *
 *         出口参数: 无
 *
 *             说明:
 *
 *******************************************************************************************************/
void I2C_Stop(void)
{
    SCL_L;
    I2C_delay();
    SDA_L;
    I2C_delay();
    SCL_H;
    I2C_delay();
    SDA_H;
    I2C_delay();
}

//======================================================================================================
/*******************************************************************************************************
 *
 *         函数名称: 
 *
 *         函数功能: 
 *
 *         入口参数: 
 *
 *         出口参数: 无
 *
 *             说明:
 *
 *******************************************************************************************************/
void I2C_Ack(void)
{        
    SCL_L;
    I2C_delay();
    SDA_L;
    I2C_delay();
    SCL_H;
    I2C_delay();
    SCL_L;
    I2C_delay();
    
}

//======================================================================================================
/*******************************************************************************************************
 *
 *         函数名称: 
 *
 *         函数功能: 
 *
 *         入口参数: 
 *
 *         出口参数: 无
 *
 *             说明:
 *
 *******************************************************************************************************/
void I2C_NoAck(void)
{        
    SCL_L;
    I2C_delay();
    SDA_H;
    I2C_delay();
    SCL_H;
    I2C_delay();
    SCL_L;
    I2C_delay();
    
}

//======================================================================================================
/*******************************************************************************************************
 *
 *         函数名称: 
 *
 *         函数功能: 
 *
 *         入口参数: 
 *
 *         出口参数: 无
 *
 *             说明:
 *
 *******************************************************************************************************/
BOOL I2C_WaitAck(void)          //返回为:=1有ACK,=0无ACK
{
    SCL_L;
    I2C_delay();
    SDA_H;                        
    I2C_delay();
    SCL_H;
    I2C_delay();
    
    if(SDA_read)
    {
        SCL_L;
        return FALSE;
    }
        
    SCL_L;
    
    return TRUE;
}

//======================================================================================================
/*******************************************************************************************************
 *
 *         函数名称: 
 *
 *         函数功能: 
 *
 *         入口参数: 
 *
 *         出口参数: 无
 *
 *             说明:
 *
 *******************************************************************************************************/
void I2C_SendByte(u8 SendByte) //数据从高位到低位//
{
    u8 i=8;
    
    while(i--)
    {
        SCL_L;
        I2C_delay();
        
        if(SendByte&0x80)
        {
            SDA_H;  
        }
        else 
        {
            SDA_L;   
        }
        
        SendByte<<=1;
        I2C_delay();
        SCL_H;
        I2C_delay();
        
    }
    
    SCL_L;
    
}

//======================================================================================================
/*******************************************************************************************************
 *
 *         函数名称: 
 *
 *         函数功能: 
 *
 *         入口参数: 
 *
 *         出口参数: 无
 *
 *             说明:
 *
 *******************************************************************************************************/
u8 I2C_ReceiveByte(void)  //数据从高位到低位//
{ 
    u8 i = 8;
    u8 ReceiveByte = 0;

    SDA_H;                                
    while(i--)
    {
        ReceiveByte <<= 1;      
        SCL_L;
        I2C_delay();
        SCL_H;
        I2C_delay();    
        
        if(SDA_read)
        {
            ReceiveByte |= 0x01;
        }
        
    }
    
    SCL_L;
    
    return ReceiveByte;
    
}


//======================================================================================================
/*******************************************************************************************************
 *
 *         函数名称: 
 *
 *         函数功能: 
 *
 *         入口参数: 
 *
 *         出口参数: 无
 *
 *             说明:
 *
 *******************************************************************************************************/
BOOL I2C_Simu_BuffWrite(u8* pBuffer, u16 WriteAddr, u16 NumByteToWrite)
{
    u8 Addr = 0, count = 0;

    Addr  = WriteAddr / I2C_PageSize;
    count = WriteAddr % I2C_PageSize;
    Addr  = Addr << 1;
    Addr  = Addr & 0x0F;  

    FRAM_ADDRESS = I2C1_SLAVE_ADDRESS7 | Addr;

    if (!I2C_Start()) 
    {
        return FALSE;
    }
    
    I2C_SendByte(FRAM_ADDRESS);//设置器件地址+段地址 
    
    if (!I2C_WaitAck())
    {
        I2C_Stop(); 
        return FALSE;
    }
    
    I2C_SendByte(count);   //设置段内地址      
    I2C_WaitAck();        

    while(NumByteToWrite--)
    {
        I2C_SendByte(* pBuffer);
        I2C_WaitAck();
        pBuffer++;
    }
    
    I2C_Stop();
    
    //注意：因为这里要等待EEPROM写完，可以采用查询或延时方式(10ms)
    //Systick_Delay_1ms(10);
    return TRUE;
    
}

//======================================================================================================
/*******************************************************************************************************
 *
 *         函数名称: 
 *
 *         函数功能: 
 *
 *         入口参数: 
 *
 *         出口参数: 无
 *
 *             说明:
 *
 *******************************************************************************************************/
BOOL I2C_Simu_WriteMulBytes(u8* pBuffer, u16 WriteAddr, u16 NumByteToWrite)
{
    while(NumByteToWrite--)
    {
       I2C_Simu_WriteByte(*pBuffer++, WriteAddr++); 
    }        
       
    return TRUE;
}
//======================================================================================================
/*******************************************************************************************************
 *
 *         函数名称: 
 *
 *         函数功能: 
 *
 *         入口参数: 
 *
 *         出口参数: 无
 *
 *             说明:
 *
 *******************************************************************************************************/
BOOL I2C_Simu_ReadMulBytes(u8* pBuffer, u16 ReadAddr, u16 NumByteToRead)
{
    while(NumByteToRead--)
    {
       I2C_Simu_ReadByte(pBuffer++, ReadAddr++); 
    }        
       
    return TRUE;
}

//======================================================================================================
/*******************************************************************************************************
 *
 *         函数名称: 
 *
 *         函数功能: 
 *
 *         入口参数: 
 *
 *         出口参数: 无
 *
 *             说明:
 *
 *******************************************************************************************************/
BOOL I2C_Simu_WriteByte(u8 byte_data, u16 addr)
{
    volatile u16 dev_addr;

    if (!I2C_Start()) 
    {
        return FALSE;
    }
    
   #ifdef _24WC08
      dev_addr = addr & 0x3FF;//1K地址范围  
   #endif   
    dev_addr  = I2C1_SLAVE_ADDRESS7 | ((addr >> 8) << 1);   //addr >> 7---A8,A9(bit1,bit2)
    
    I2C_SendByte(dev_addr | I2C_WRITE);//设置器件地址,
    
    if (!I2C_WaitAck())
    {
        I2C_Stop(); 
        return FALSE;
    }
    
    I2C_SendByte(addr);      
    I2C_WaitAck();    

    I2C_SendByte(byte_data);       
    I2C_WaitAck();    

   
    I2C_Stop();
    
    //注意：因为这里要等待EEPROM写完，可以采用查询或延时方式(10ms)
    //Systick_Delay_1ms(10);
    Delay(200000);  //必要的延时
    
    return TRUE;
    
}


//======================================================================================================
/*******************************************************************************************************
 *
 *         函数名称: 
 *
 *         函数功能: 
 *
 *         入口参数: 
 *
 *         出口参数: 无
 *
 *             说明:
 *
 *******************************************************************************************************/
BOOL I2C_Simu_ReadByte(u8 *byte_data, u16 addr)
{
    volatile u16 dev_addr;
    
    
    if (!I2C_Start()) 
    {
        return FALSE;
    }
    
   #ifdef _24WC08
      addr = addr & 0x3FF;//1K地址范围  
   #endif   
    
    dev_addr  = I2C1_SLAVE_ADDRESS7 | ((addr >> 8) << 1);
    I2C_SendByte(dev_addr | I2C_WRITE);//设置器件地址,addr >> 7---A8,A9(bit1,bit2)
       

    if (!I2C_WaitAck()) 
    {
        I2C_Stop(); 
        return FALSE;
    }

    I2C_SendByte(addr);   //设置低起始地址      
    I2C_WaitAck();
    
    I2C_Start();
    I2C_SendByte(dev_addr | I2C_READ);
    I2C_WaitAck();
    
    *byte_data = I2C_ReceiveByte();
    I2C_NoAck();
    
    I2C_Stop();
    
    ///Delay(1000);
    return TRUE;
    
}


//======================================================================================================
/*******************************************************************************************************
 *
 *         函数名称: 
 *
 *         函数功能: 
 *
 *         入口参数: 
 *
 *         出口参数: 无
 *
 *             说明:
 *
 *******************************************************************************************************/        
BOOL I2C_Simu_BuffRead(u8* pBuffer, u16 WriteAddr, u16 NumByteToRead)
{                
    u8 Addr = 0, count = 0;

    Addr  = WriteAddr / I2C_PageSize;
    count = WriteAddr % I2C_PageSize;
    Addr  = Addr << 1;
    Addr  = Addr & 0x0F;  

    FRAM_ADDRESS = I2C1_SLAVE_ADDRESS7 | Addr;

    if (!I2C_Start()) 
    {
        return FALSE;
    }
    
    I2C_SendByte(FRAM_ADDRESS);//设置器件地址+段地址 

    if (!I2C_WaitAck()) 
    {
        I2C_Stop(); 
        return FALSE;
    }

    I2C_SendByte(count);   //设置低起始地址      
    I2C_WaitAck();
    I2C_Start();
    I2C_SendByte(FRAM_ADDRESS | 0x01);
    I2C_WaitAck();
    while(NumByteToRead)
    {
        *pBuffer = I2C_ReceiveByte();
        if(NumByteToRead == 1)
        {
            I2C_NoAck();
        }
        else
        {
            I2C_Ack(); 
        }
        
        pBuffer++;
        NumByteToRead--;
        
    }
    
    I2C_Stop();
    
    return TRUE;
    
}

